package lessons1_20.practice16;

// Задача 1:
//Создать var переменную с текстовым блоком и вывести в консоль.
public class Task1 {
    public static void main(String[] args) {
       var text =  ("""
                erg
                guyk
                re e4rt
                """);
        System.out.println(text);


    }
}
